import pytest

from utsuho.converters import KatakanaToHiraganaConverter


@pytest.mark.parametrize('s,expect', [
    ('ア', 'あ'), ('イ', 'い'), ('ウ', 'う'), ('エ', 'え'), ('オ', 'お'),
    ('カ', 'か'), ('キ', 'き'), ('ク', 'く'), ('ケ', 'け'), ('コ', 'こ'),
    ('サ', 'さ'), ('シ', 'し'), ('ス', 'す'), ('セ', 'せ'), ('ソ', 'そ'),
    ('タ', 'た'), ('チ', 'ち'), ('ツ', 'つ'), ('テ', 'て'), ('ト', 'と'),
    ('ナ', 'な'), ('ニ', 'に'), ('ヌ', 'ぬ'), ('ネ', 'ね'), ('ノ', 'の'),
    ('ハ', 'は'), ('ヒ', 'ひ'), ('フ', 'ふ'), ('ヘ', 'へ'), ('ホ', 'ほ'),
    ('マ', 'ま'), ('ミ', 'み'), ('ム', 'む'), ('メ', 'め'), ('モ', 'も'),
    ('ヤ', 'や'), ('ユ', 'ゆ'), ('ヨ', 'よ'),
    ('ラ', 'ら'), ('リ', 'り'), ('ル', 'る'), ('レ', 'れ'), ('ロ', 'ろ'),
    ('ワ', 'わ'), ('ヰ', 'ゐ'), ('ヱ', 'ゑ'), ('ヲ', 'を'),
    ('ン', 'ん'),
    ('ァ', 'ぁ'), ('ィ', 'ぃ'), ('ゥ', 'ぅ'), ('ェ', 'ぇ'), ('ォ', 'ぉ'),
    ('ヵ', 'ゕ'), ('ヶ', 'ゖ'),
    ('ッ', 'っ'),
    ('ャ', 'ゃ'), ('ュ', 'ゅ'), ('ョ', 'ょ'),
    ('ヮ', 'ゎ'),
    ('ヴ', 'ゔ'),
    ('ガ', 'が'), ('ギ', 'ぎ'), ('グ', 'ぐ'), ('ゲ', 'げ'), ('ゴ', 'ご'),
    ('ザ', 'ざ'), ('ジ', 'じ'), ('ズ', 'ず'), ('ゼ', 'ぜ'), ('ゾ', 'ぞ'),
    ('ダ', 'だ'), ('ヂ', 'ぢ'), ('ヅ', 'づ'), ('デ', 'で'), ('ド', 'ど'),
    ('バ', 'ば'), ('ビ', 'び'), ('ブ', 'ぶ'), ('ベ', 'べ'), ('ボ', 'ぼ'),
    ('パ', 'ぱ'), ('ピ', 'ぴ'), ('プ', 'ぷ'), ('ペ', 'ぺ'), ('ポ', 'ぽ'),
    ('ヽ', 'ゝ'), ('ヾ', 'ゞ'),
    ('「Ａアガ　Ｂ漢」', '「Ａあが　Ｂ漢」'),
])
def test_katakana_to_hiragana(s, expect):
    cnv = KatakanaToHiraganaConverter()
    actual = cnv.convert(s)
    assert actual == expect


def test_katakana_to_hiragana_invalid_parameter():
    cnv = KatakanaToHiraganaConverter()

    with pytest.raises(TypeError, match='s must be a string.') as exc:
        cnv.convert(None)
